app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("user_name", "body", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "DoggyeLovaahh"], ["body", "Best idea ever!"], ["idea_id", 1], ["created_at", "2017-05-13 12:07:42.988551"], ["updated_at", "2017-05-13 12:07:42.988551"]]