app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
    @comments = @idea.comments.all
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def edit
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @idea = Idea.new(idea_params)
    if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @idea = Idea.find(params[:id])
    if @idea.update(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "ideas" SET "name" = ?, "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Doggy Faves"], ["picture", "doggies.jpg"], ["updated_at", "2017-05-13 11:48:10.449373"], ["id", 1]]

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 5]]